---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionNoSingleRef
source: html/b988d3ac-6807-4e20-befd-8393ff12e8ed.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionNoSingleRef Property

Summary: Structural Connection Handler lost connected element.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralConnectionNoSingleRef { get; }
```